================================================================================
Inline code expression
================================================================================
foo #bar baz
--------------------------------------------------------------------------------

(source_file
  (markup
    (text)
    (space)
    (embedded_code_expr
      (variable
        (code_ident)))
    (space)
    (text)))

================================================================================
Inline code expression with newlines
================================================================================
foo
#bar
baz
--------------------------------------------------------------------------------

(source_file
  (markup
    (text)
    (space)
    (embedded_code_expr
      (variable
        (code_ident)))
    (space)
    (text)))

================================================================================
Identifier
================================================================================
#foo
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (variable
        (code_ident)))))

================================================================================
Empty content block
================================================================================
#[]
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (content_block))))

================================================================================
Content block with content
================================================================================
#[hello world]
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (content_block
        (markup
          (text))))))

================================================================================
Content block with content with heading
================================================================================
#[= heading]
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (content_block
        (markup
          (heading
            (heading_start)
            (space)
            (markup
              (text))))))))

================================================================================
Empty code block
================================================================================
#{}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_block))))

================================================================================
Code block, one line
================================================================================
#{
  10
}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_block
        (space)
        (code_number
          (code_int))))))

================================================================================
Code block, multiple lines
================================================================================
#{
  let test = "5"
  10
  test
}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_block
        (space)
        (let_binding
          (space)
          (pattern
            (code_ident))
          (space)
          (space)
          (string))
        (code_number
          (code_int))
        (variable
          (code_ident))))))

================================================================================
Empty array
================================================================================
#()
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array))))

================================================================================
Parenthesized
================================================================================
#(none)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_parenthesized))))

================================================================================
Parenthesized, with spaces
================================================================================
#( none )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_parenthesized
        (space)
        (space)))))

================================================================================
Array, one element
================================================================================
#(none,)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array))))

================================================================================
Array, multiple elements
================================================================================
#(none, none, auto)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array
        (space)
        (space)))))

================================================================================
Array, multiple elements, spacing everywhere, trailing comma
================================================================================
#(
  none ,
  none ,
  auto ,
)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array
        (space)
        (space)
        (space)
        (space)
        (space)
        (space)
        (space)))))

================================================================================
Array, one spread
================================================================================
#(..foo)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array
        (spread
          (variable
            (code_ident)))))))

================================================================================
Array, multiple spreads, spacing everywhere
================================================================================
#( .. foo, .. bar )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (array
        (space)
        (spread
          (space)
          (variable
            (code_ident)))
        (space)
        (spread
          (space)
          (variable
            (code_ident)))
        (space)))))

================================================================================
Empty dictionary
================================================================================
#(:)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict))))

================================================================================
Empty dictionary with extra spacing
================================================================================
#( : )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (space)))))

================================================================================
Empty dictionary, empty spread
================================================================================
#(: ..)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (spread)))))

================================================================================
Prefixed dictionary, spread from variable
================================================================================
#(: ..foo)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (spread
          (variable
            (code_ident)))))))

================================================================================
Prefixed dictionary, multiple spreads
================================================================================
#(: ..foo, ..bar)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (spread
          (variable
            (code_ident)))
        (space)
        (spread
          (variable
            (code_ident)))))))

================================================================================
Prefixed dictionary, spread with space
================================================================================
#(: .. foo)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (spread
          (space)
          (variable
            (code_ident)))))))

================================================================================
Prefixed dictionary, with values
================================================================================
#(: foo: none, "baz": none)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (named_value
          (code_ident)
          (space))
        (space)
        (named_value
          (string)
          (space))))))

================================================================================
Prefixed dictionary, with values, trailing comma
================================================================================
#(:
  foo: none,
  "baz": none,
)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (named_value
          (code_ident)
          (space))
        (space)
        (named_value
          (string)
          (space))
        (space)))))

================================================================================
Unprefixed dictionary, with values, spaces everywhere
================================================================================
#(
  foo : none ,
  "baz" : none
)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (named_value
          (code_ident)
          (space)
          (space))
        (space)
        (space)
        (named_value
          (string)
          (space)
          (space))
        (space)))))

================================================================================
Unprefixed dictionary, with values, spaces everywhere, trailing comma
================================================================================
#(
  foo : none ,
  "baz" : none ,
)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (dict
        (space)
        (named_value
          (code_ident)
          (space)
          (space))
        (space)
        (space)
        (named_value
          (string)
          (space)
          (space))
        (space)
        (space)))))

================================================================================
Integer
================================================================================
#123
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_int)))))

================================================================================
Float
================================================================================
#123.456
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Float, trailing comma
================================================================================
#123.
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Float, leading comma
================================================================================
#.123
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Float, exponent
================================================================================
#5e5
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Float, exponent with plus
================================================================================
#5E+5
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Float, exponent with minus
================================================================================
#5e-5
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Numeric
================================================================================
#3.5em
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (code_number
        (code_float)))))

================================================================================
Label
================================================================================
#<foo>
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (label))))

================================================================================
Raw
================================================================================
#`raw`
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (raw))))

================================================================================
Let binding, just declaration
================================================================================
#let test
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern
          (code_ident))))))

================================================================================
Let binding, with value set
================================================================================
#let test = 5
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern
          (code_ident))
        (space)
        (space)
        expr: (code_number
          (code_int))))))

================================================================================
Let binding, heading on next line
================================================================================
#let test
= 5
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern
          (code_ident))))
    (heading
      (heading_start)
      (space)
      inner: (markup
        (text)))))

================================================================================
Let binding, after text, heading on next line
================================================================================
test
#let test
= 5
--------------------------------------------------------------------------------

(source_file
  (markup
    (text)
    (space)
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern
          (code_ident))))
    (heading
      (heading_start)
      (space)
      inner: (markup
        (text)))))

================================================================================
Let binding, name parenthesized
================================================================================
#let (test) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern
          (pattern_parenthesized
            (code_ident)))
        (space)
        (space)))))

================================================================================
Let binding, underscore as name
================================================================================
#let _ = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern)
        (space)
        (space)))))

================================================================================
Let binding, empty array destructuring
================================================================================
#let () = ()
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_destructuring)
        (space)
        (space)
        expr: (array)))))

================================================================================
Let binding, non-empty array destructuring
================================================================================
#let (foo, bar) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_destructuring
          (code_ident)
          (space)
          (code_ident))
        (space)
        (space)))))

================================================================================
Let binding, array destructuring, trailing comma
================================================================================
#let ( foo , ) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_destructuring
          (space)
          (code_ident)
          (space)
          (space))
        (space)
        (space)))))

================================================================================
Let binding, dictionary destructuring
================================================================================
#let ( foo : bar ) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_destructuring
          (space)
          (pattern_named
            field: (code_ident)
            (space)
            (space)
            binding: (code_ident))
          (space))
        (space)
        (space)))))

================================================================================
Function definition
================================================================================
#let foo() = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params))
        (space)
        (space)))))

================================================================================
Function definition, space in parentheses
================================================================================
#let foo( ) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (space)))
        (space)
        (space)))))

================================================================================
Function definition, one argument
================================================================================
#let foo(bar) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (code_ident)))
        (space)
        (space)))))

================================================================================
Function definition, one argument, spacing everywhere, trailing comma
================================================================================
#let foo( bar , ) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (space)
            (code_ident)
            (space)
            (space)))
        (space)
        (space)))))

================================================================================
Function definition, multiple arguments
================================================================================
#let foo(bar, baz, quux) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (code_ident)
            (space)
            (code_ident)
            (space)
            (code_ident)))
        (space)
        (space)))))

================================================================================
Function definition, named arguments
================================================================================
#let foo(bar: (), baz : "") = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (param_named
              name: (code_ident)
              (space)
              value: (array))
            (space)
            (param_named
              name: (code_ident)
              (space)
              (space)
              value: (string))))
        (space)
        (space)))))

================================================================================
Function definition, spread
================================================================================
#let foo(..bar) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (pattern_spread
              (code_ident))))
        (space)
        (space)))))

================================================================================
Function definition, destructuring
================================================================================
#let foo((bar: baz)) = none
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (let_binding
        (space)
        pattern: (pattern_closure
          name: (code_ident)
          params: (params
            (pattern_destructuring
              (pattern_named
                field: (code_ident)
                (space)
                binding: (code_ident)))))
        (space)
        (space)))))

================================================================================
Set rule, no arguments
================================================================================
#set text()
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args)))))

================================================================================
Set rule, field access, no arguments
================================================================================
#set enum.item()
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          object: (set_rule_field_access
            name: (code_ident))
          field: (code_ident))
        arguments: (code_args)))))

================================================================================
Set rule, field access, no arguments, spacing everywhere
================================================================================
#set enum
  . item (
  )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          object: (set_rule_field_access
            name: (code_ident))
          (space)
          (space)
          field: (code_ident))
        (space)
        arguments: (code_args
          (space))))))

================================================================================
Set rule, field access, newline after dot
================================================================================
#set enum
  .
  item (
  )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          object: (set_rule_field_access
            name: (code_ident))
          (space)
          (ERROR)
          (space)
          field: (MISSING code_ident))
        arguments: (code_args
          (space))))))

================================================================================
Set rule, newline pefore open parenthesis
================================================================================
#set enum
  (
  )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        (ERROR
          (space))
        arguments: (code_args
          (space))))))

================================================================================
Set rule, one argument
================================================================================
#set text(5pt)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (code_number
            (code_int)))))))

================================================================================
Set rule, multiple arguments
================================================================================
#set foo( a , b , c , )
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (space)
          (variable
            (code_ident))
          (space)
          (space)
          (variable
            (code_ident))
          (space)
          (space)
          (variable
            (code_ident))
          (space)
          (space))))))

================================================================================
Set rule, named argument
================================================================================
#set text(size : 10pt)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (code_args_named
            name: (code_ident)
            (space)
            (space)
            value: (code_number
              (code_int))))))))

================================================================================
Set rule, spread
================================================================================
#set text(..)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (spread))))))

================================================================================
Set rule, spread value
================================================================================
#set text(..rest)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (spread
            (variable
              (code_ident))))))))

================================================================================
Set rule, mixed
================================================================================
#set text(5pt, font: "Inter", ..rest)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (code_number
            (code_int))
          (space)
          (code_args_named
            name: (code_ident)
            (space)
            value: (string))
          (space)
          (spread
            (variable
              (code_ident))))))))

================================================================================
Set rule, b
================================================================================
#set text(5pt, font: "Inter", ..rest)
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args
          (code_number
            (code_int))
          (space)
          (code_args_named
            name: (code_ident)
            (space)
            value: (string))
          (space)
          (spread
            (variable
              (code_ident))))))))

================================================================================
Set-if rule
================================================================================
#set foo() if bar
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args)
        (space)
        (space)
        condition: (variable
          (code_ident))))))

================================================================================
Set, next line if
================================================================================
#set foo()
if bar
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (set_rule
        (space)
        target: (set_rule_field_access
          name: (code_ident))
        arguments: (code_args)))
    (text)))

================================================================================
Show, no selector
================================================================================
#show: "foo"
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (show_rule
        (space)
        transform: (string)))))

================================================================================
Show, no selector, spacing everywhere
================================================================================
#show : "foo"
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (show_rule
        (space)
        (space)
        transform: (string)))))

================================================================================
Show, with selector
================================================================================
#show heading: "foo"
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (show_rule
        (space)
        selector: (variable
          (code_ident))
        (space)
        transform: (string)))))

================================================================================
Show, with selector, spacing everywhere
================================================================================
#show heading : "foo"
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (show_rule
        (space)
        selector: (variable
          (code_ident))
        (space)
        (space)
        transform: (string)))))

================================================================================
Show, next line selector
================================================================================
#show
heading: none
--------------------------------------------------------------------------------

(source_file
  (ERROR)
  (markup
    (space)
    (text)
    (text)
    (space)
    (text)))

================================================================================
Show, next line transform
================================================================================
#show heading
: none
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (space)
    (variable
      (code_ident)))
  (markup
    (space)
    (text)
    (space)
    (text)))

================================================================================
Conditional, no else, code block
================================================================================
#if true {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)))))

================================================================================
Conditional, no else, content block
================================================================================
#if true []
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (content_block)))))

================================================================================
Conditional, no else, newline after if
================================================================================
#if
true {}
--------------------------------------------------------------------------------

(source_file
  (ERROR)
  (markup
    (space)
    (text)
    (space))
  (ERROR))

================================================================================
Conditional, no else, newline after expression
================================================================================
#if true
{}
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (space))
  (markup
    (space))
  (ERROR))

================================================================================
Conditional, with else
================================================================================
#if true {} else {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)
        (space)
        (space)
        (code_block)))))

================================================================================
Conditional, with else, newline before else
================================================================================
#if true {}
else {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)))
    (space)
    (text)
    (space))
  (ERROR))

================================================================================
Conditional, with else, newline after else
================================================================================
#if true {} else
{}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)))
    (ERROR
      (space))
    (space))
  (ERROR))
  
================================================================================
Conditional, else if
================================================================================
#if true {} else if true {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)
        (space)
        (space)
        (conditional
          (space)
          (space)
          (code_block))))))

================================================================================
Conditional, multiple else if
================================================================================
#if true {} else if true {} else if true {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (conditional
        (space)
        (space)
        (code_block)
        (space)
        (space)
        (conditional
          (space)
          (space)
          (code_block)
          (space)
          (space)
          (conditional
            (space)
            (space)
            (code_block)))))))

================================================================================
While loop, code block
================================================================================
#while true {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (while_loop
        (space)
        (space)
        (code_block)))))

================================================================================
While loop, content block
================================================================================
#while true []
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (while_loop
        (space)
        (space)
        (content_block)))))

================================================================================
While loop, newline before condition
================================================================================
#while
true {}
--------------------------------------------------------------------------------

(source_file
  (ERROR)
  (markup
    (space)
    (text)
    (space))
  (ERROR))

================================================================================
While loop, newline after condition
================================================================================
#while true
{}
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (space))
  (markup
    (space))
  (ERROR))

================================================================================
For loop
================================================================================
#for x in () {}
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (for_loop
        (space)
        (pattern
          (code_ident))
        (space)
        (space)
        (array)
        (space)
        (code_block)))))

================================================================================
For loop, newline before body
================================================================================
#for x in ()
{}
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (space)
    (pattern
      (code_ident))
    (space)
    (space)
    (array))
  (markup
    (space))
  (ERROR))

================================================================================
Import module
================================================================================
#import "test.typ"
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)))))

================================================================================
Import everything from module
================================================================================
#import "test.typ": *
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)
        (space)))))

================================================================================
Import nothing from module
================================================================================
#import "test.typ":
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)))))

================================================================================
Import items from module
================================================================================
#import "test.typ": foo, bar
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)
        (space)
        (code_ident)
        (space)
        (code_ident)))))

================================================================================
Import items from module, trailing comma
================================================================================
#import "test.typ": foo, bar,
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)
        (space)
        (code_ident)
        (space)
        (code_ident)))))

================================================================================
Import items from module, trailing comma, spacing everywhere
================================================================================
#import "test.typ" : foo , bar ,
--------------------------------------------------------------------------------

(source_file
  (markup
    (embedded_code_expr
      (module_import
        (space)
        (string)
        (space)
        (space)
        (code_ident)
        (space)
        (space)
        (code_ident)
        (space)))))

