================================================================================
Empty equation
================================================================================
$$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation)))

================================================================================
Shorthand
================================================================================
$-> ~~>$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_shorthand)
        (space)
        (math_shorthand)))))

================================================================================
Delimited, non-shorthand
================================================================================
$⟪x⟫$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_delimited_left)
          inner: (math
            (math_text))
          right: (math_delimited_right))))))

================================================================================
Delimited, shorthand
================================================================================
$[|x|]$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_delimited_left
            (math_shorthand))
          inner: (math
            (math_text))
          right: (math_delimited_right
            (math_shorthand)))))))

================================================================================
Delimited, multiple expressions as content
================================================================================
$(a, b)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_delimited_left)
          inner: (math
            (math_text)
            (math_text)
            (space)
            (math_text))
          right: (math_delimited_right))))))

================================================================================
Delimited, shorthand, no content
================================================================================
$[||]$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_delimited_left
            (math_shorthand))
          right: (math_delimited_right
            (math_shorthand)))))))

================================================================================
Delimited, non-matching
================================================================================
$[|x⟫$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_delimited_left
            (math_shorthand))
          inner: (math
            (math_text))
          right: (math_delimited_right))))))

================================================================================
Delimited, unclosed
================================================================================
$[|x$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_unclosed
          left: (math_delimited_left
            (math_shorthand))
          inner: (math
            (math_text)))))))

================================================================================
Delimited, fenced FIXME
================================================================================
$||x||$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_fence_unclosed
          left: (math_fence
            (math_shorthand))
          inner: (math
            (math_text)
            (math_delimited_fence_unclosed
              left: (math_fence
                (math_shorthand)))))))))

================================================================================
Delimited, fenced, no content
================================================================================
$||||$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_fence
          left: (math_fence
            (math_shorthand))
          right: (math_fence
            (math_shorthand)))))))

================================================================================
Single fence
================================================================================
$||$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_fence_unclosed
          left: (math_fence
            (math_shorthand)))))))

================================================================================
Triple fence
================================================================================
$||||||$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_fence
          left: (math_fence
            (math_shorthand))
          right: (math_fence
            (math_shorthand)))
        (math_delimited_fence_unclosed
          left: (math_fence
            (math_shorthand)))))))

================================================================================
Linebreak
================================================================================
$\ $
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (linebreak)))))

================================================================================
Math align point
================================================================================
$&$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_align_point)))))

================================================================================
Escape
================================================================================
$\u{FFEF}$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (escape)))))

================================================================================
String
================================================================================
$"hello \" world"$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (string)))))

================================================================================
Field access
================================================================================
$dot.c$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_field_access
          target: (math_ident)
          field: (math_ident))))))

================================================================================
Field access, multiple
================================================================================
$dot.h.c$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_field_access
          target: (math_ident)
          field: (math_ident)
          field: (math_ident))))))

================================================================================
Field access, trailing number
================================================================================
$foo.5.5$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_field_access
          target: (math_ident)
          field: (math_ident))))))

================================================================================
Field access, trailing grapheme
================================================================================
$foo.♥$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_field_access
          target: (math_ident)
          field: (math_ident))))))

================================================================================
Function call, no arguments
================================================================================
$sqrt()$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args))))))

================================================================================
Function call, empty argument
================================================================================
$sqrt(,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args))))))

================================================================================
Function call, one argument
================================================================================
$sqrt(5)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, one argument, trailing comma
================================================================================
$sqrt(5,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, two arguments
================================================================================
$foo(1, 2)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (math
              (space)
              (math_text))))))))

================================================================================
Function call, two arguments, trailing comma
================================================================================
$foo(1, 2,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (math
              (space)
              (math_text))))))))

================================================================================
Function call, one named argument
================================================================================
$foo(bar:5)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          function: (math_field_access
            target: (math_ident))
          args: (math_args
            (math_arg_named
              name: (math_ident)
              arg: (math
                (math_text)))))))))

================================================================================
Function call, one named argument without value
================================================================================
$foo(bar:)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          function: (math_field_access
            target: (math_ident))
          args: (math_args
            (math_arg_named
              name: (math_ident))))))))

================================================================================
Function call, one unnamed argument, then one named argument
================================================================================
$foo(0, bar: 1)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          function: (math_field_access
            target: (math_ident))
          args: (math_args
            (math
              (math_text))
            (space)
            (math_arg_named
              name: (math_ident)
              arg: (math
                (space)
                (math_text)))))))))

================================================================================
Function call, empty array
================================================================================
$foo(;)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args))))))

================================================================================
Function call, one array
================================================================================
$foo(1;)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, trailing array
================================================================================
$mat(1, 2; 3, 4)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (math
              (space)
              (math_text))
            (math
              (space)
              (math_text))
            (math
              (space)
              (math_text))))))))

================================================================================
Root
================================================================================
$√x$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_root
          expr: (math_text))))))

================================================================================
Root, parenthesized
================================================================================
$√(x)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_root
          expr: (math_delimited
            left: (math_delimited_left)
            inner: (math
              (math_text))
            right: (math_delimited_right)))))))

================================================================================
Root, actual function call
================================================================================
$√sin(x)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_root
          expr: (math_function_call
            function: (math_field_access
              target: (math_ident))
            args: (math_args
              (math
                (math_text)))))))))

================================================================================
Attach below
================================================================================
$x_0$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_attach_below
          expr: (math_text)
          below: (math_text))))))

================================================================================
Attach below
================================================================================
$x_0$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_attach_below
          expr: (math_text)
          below: (math_text))))))

================================================================================
Attach above
================================================================================
$x^0$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_attach_above
          expr: (math_text)
          above: (math_text))))))

================================================================================
Attach above, then below
================================================================================
$x^a_b$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_attach_above
          expr: (math_text)
          above: (math_attach_below
            expr: (math_text)
            below: (math_text)))))))

================================================================================
Attach above, then below
================================================================================
$x^a_b$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_attach_above
          expr: (math_text)
          above: (math_attach_below
            expr: (math_text)
            below: (math_text)))))))

================================================================================
Fraction
================================================================================
$a/b$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_frac
          numerator: (math_text)
          denominator: (math_text))))))

================================================================================
Fraction and root
================================================================================
$√a/b$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_frac
          numerator: (math_root
            expr: (math_text))
          denominator: (math_text))))))

================================================================================
Fraction, then text
================================================================================
$a/b+1$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_frac
          numerator: (math_text)
          denominator: (math_text))
        (math_text)
        (math_text)))))
